#include "BokoviVypady.h"
void BokoviVypady::DoExercise() { // робимо вправу
	SetName("боков≥ випади"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void BokoviVypady::ShowInfo() { // виводимо про вправу
	cout << " ¬права, зосереджена б≥льше на зовн≥шн≥й частин≥ с≥дниць та стегон" <<
		endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х поставте ноги тр≥шки ширше за ширину стегон, корпус працюЇ, оч≥ дивл€тьс€ пр€мо" << endl;
		cout << " Х роб≥ть широкий крок вправо ≥ прис≥даЇте" << endl;
	cout << " Х опускайте т≥ло доти, доки праве стегно не утворюЇ паралель з п≥длогою" << endl;
		cout << " Х зупин≥тьс€, в≥дштовх≥тьс€ л≥вою ногою ≥ поверн≥тьс€ на початкову позиц≥ю" << endl;
		cout << " Х повтор≥ть на ≥нший б≥к" << endl << endl;
	cout << " Х повтор≥ть вправу 30 раз (15+15), чергуючи раз праву ногу, раз л≥ву"<< endl;
}
