#include "Burpee.h"
void Burpee::DoExercise() { // робимо вправу
	SetName("берп≥"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void Burpee::ShowInfo() { // виводимо про вправу
	cout << " ¬права зад≥юЇ вс≥ велик≥ мТ€зов≥ групи т≥ла, а максимальне навантаженн€ отримують прес, ноги, " << endl <<
		" груди ≥ верх спини; вправа розвиваЇ не т≥льки витривал≥сть, а також силу	≥ координац≥ю рух≥в-- - " << endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х з положенн€ сто€чи, прис≥сти ≥ покласти обидв≥ долон≥ на п≥длогу перед собою" << endl;
	cout << " Х у стрибку вит€гнути ноги ≥ зайн€ти позиц≥ю планки" << endl;
	cout << " Х у стрибку знову зайн€ти вих≥дну позиц≥ю" << endl;
	cout << " Х встати у вих≥дне положенн€" << endl << endl;
	cout << " Х повтор≥ть вправу 10 раз" << endl;
}