#include "HyperExtensions.h"
void HyperExtensions::DoExercise() { // робимо вправу
	SetName("г≥перекстенз≥њ"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void HyperExtensions::ShowInfo() { // виводимо про вправу
	cout << " ¬права дл€ розвитку випр€мл€ч≥в спини, згинач≥в гом≥лки ≥ с≥дничних м'€з≥в---" << endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х впр≥тьс€ стегнами в опору ≥, закр≥пивши ноги" << endl;
	cout << " Х перебуваючи в з≥гнутому положенн≥ головою вниз, починайте п≥дн≥мати тулуб ≥ руки" << endl;
	cout << " Х п≥дн≥майте до повного випр€мленн€ спини без вигинанн€ голови у верхн≥й точц≥" << endl << endl;
	cout << " Х повтор≥ть вправу 10 раз" << endl << endl;
}
