#include "Lodochka.h"
void Lodochka::DoExercise() { // робимо вправу
	SetName("лодочка"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void Lodochka::ShowInfo() { // виводимо про вправу
	cout << " ‘ормуЇ гарну осанку, зн≥маЇ б≥ль у попереку, розвиваЇ м'€зи спини---" <<
	endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х л€жте на п≥длогу обличч€м вниз" << endl;
	cout << " Х пот€гн≥ть руки вперед, а ноги - назад" << endl;
	cout << " Х видихаючи, напружте с≥дниц≥ ≥ поперек" << endl;
	cout << " Х п≥дн≥м≥ть верхн≥ ≥ нижн≥ к≥нц≥вки в≥д стат≥" << endl;
	cout << " Х затримайтес€ в Ђпоз≥ —уперменаї на пару секунд," << endl 
		 << " пот≥м, вдихаючи, плавно опуститес€ в початкове положенн€" << endl;
	cout << " Х повтор≥ть вправу 10 раз" << endl 
		 << endl;
}
