#include "ObertGantSpina.h"
void ObertGantSpina::DoExercise() { // робимо вправу
	SetName("обертанн€ гантел≥ на спин≥"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void ObertGantSpina::ShowInfo() { // виводимо про вправу
	cout << " ƒл€ ц≥Їњ вправи краще обирати легку гантель. Ћ€жте на спину на лаву, плечем не торкаючись поверхн≥." << endl;
	cout << "–озташуйте руку так, щоб л≥коть утворював пр€мий кут й був " << endl;
	cout << "на одн≥й л≥н≥њ з плечем, а запТ€ст€ Ц на л≥кт≥.÷ю вправу також можна виконувати лежачи на п≥длоз≥." << endl;
	cout << "¬иконайте 8 - 10 повторень на слабшому плеч≥, а пот≥м Ц таку ж к≥льк≥сть" << endl;
	cout << "повторень з однаковою вагою на вашому сильн≥шому плеч≥. " << endl << endl;
	cout << " Х повтор≥ть вправу 15 раз на праву руку, 15 на л≥ву" << endl;
}
