#include "OndorykiyPushGantelyaUp.h"
void OndorykiyPushGantelyaUp::DoExercise() { // робимо вправу
	SetName("однорукий жим гантел≥ вгору"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void OndorykiyPushGantelyaUp::ShowInfo() { // виводимо про вправу
	cout << " ¬иконанн€: " << endl << endl;
	cout << " ќбер≥ть не дуже важку гантель Ц ви повинн≥ п≥дн€ти њњ не вигнувши спину." << endl
		 << "¬аш хребет повинен залишатис€ стаб≥льним та нейтральним." << endl 
		 << "¬иконайте 8 - 10 повторень на слабшому плеч≥," << endl 
		 << " а пот≥м виконайте таку ж к≥льк≥сть повторень з однаковою вагою на вашому сильн≥шому плеч≥." <<endl;
	cout << " Х повтор≥ть вправу 15 раз на праву руку, 15 на л≥ву---" << endl;
}