#include "PidjomNohy.h"
void PidjomNohy::DoExercise() { // робимо вправу
	SetName("п≥дйом ноги"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void PidjomNohy::ShowInfo() { // виводимо про вправу
	cout << " ¬права зм≥цнюЇ та тон≥зуЇ стегна" << endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х л€жте на правий б≥к" << endl;
	cout << " Х пов≥льно п≥д≥йм≥ть л≥ву ногу наст≥льки високо, наск≥льки зможете" <<
		endl;
	cout << " Х затримайтес€ на вершечку, пот≥м опуст≥ть ногу та початкову позиц≥ю"
		<< endl;
	cout << " Х впевн≥тьс€, що таз заф≥ксований ≥ не 'гул€Ї', а корпус напружений"
		<< endl << endl;
	cout << " Х повтор≥ть вправу 15 раз на правий б≥к, 15 на л≥вий" << endl;
}
