#include "PojejGidr.h"
void PojejGidr::DoExercise() { // робимо вправу
	SetName("пожежний г≥дрант"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void PojejGidr::ShowInfo() { // виводимо про вправу
	cout << " ¬права нац≥лена на зону стегон та с≥дниць, також залучаЇ до роботи мТ€зи корпусу" << endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х станьте на кол≥на та долон≥ рук, ноги мають бути на ширин≥ плечей"
		<< endl;
	cout << " Х оч≥ мають дивитис€ вперед ≥ трохи вниз" << endl;
	cout << " Х залучаючи корпус, п≥дн≥м≥ть праве кол≥но вб≥к ≥ вгору(кол≥но маЇ пост≥йно бути з≥гнутим)" << endl;
	cout << " Х зупин≥тьс€ на вершечку, пот≥м опуст≥ть ногу на початкову позиц≥ю" <<
		endl << endl;
	cout << " Х зроб≥ть 10 повтор≥в на на праву ногу ≥ пот≥м 10 повтор≥в на л≥ву"
		<< endl;
}