// PoyasPull.h
#include "Vprava_base.h"
#pragma once
#include <string>
#include <iostream>

using namespace std;

class PoyasPull : public Vprava_base
{
public:
	PoyasPull(string name)
	{
		SetName(name);
	}

    void ShowInfo() override
    {
		cout << " ¬права на розвиток, внутр≥шньоњ частини найширшого м'€за, а також нижньоњ частини" << endl
			<< "трапец≥Їпод≥бного м'€за, грудинного в≥дд≥лу, найдовшого м'€зу спини, розвиваЇ б≥цепси рук. " << endl << endl;
		cout << " ¬иконанн€: " << endl;
		cout << " *з≥ штангою, сто€чи в нахил≥*" << endl;
		cout << " Х встаньте перед штангою, розташованоњ на п≥длоз≥, пот≥м нахил≥тьс€ вниз" << endl;
		cout << " Х спина пр€ма, кут нахилу корпусу до горизонту не перевищуЇ 15 ∞" <<
			endl;
		cout << " Х повтор≥ть вправу 10 раз" << endl;
		cout << " Х *в горизонтальному положенн≥ з гантелей, упершись кол≥ном в лаву*"
			<< endl;
		cout << " Х повтор≥ть вправу 10 раз на праву руку, 10 раз на л≥ву" << endl;
		cout << " Х правим кол≥ном встаЇмо на лавку, спираЇмос€ на нењ ж правою рукою (спина р≥вна, в попереку природний прогин)" << endl;
		cout << " Х л≥ву ногу трохи в≥дводимо назад ≥ залишаЇмо на п≥длоз≥, допомагаючи соб≥ утримувати р≥вновагу" << endl << endl;
		cout << " Х повтор≥ть вправу 10 раз на праву руку, 10 на л≥ву" << endl;
    }
};

