#include "Prysidannya.h"
void Prysidannya::DoExercise() { // робимо вправу
	SetName("прис≥данн€"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void Prysidannya::ShowInfo() { // виводимо про вправу
	cout << " ”н≥версальна вправа, нац≥лена на багато мТ€з≥в нижньоњ частини т≥ла" <<
		endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х поставте ноги тр≥шки ширше за ширину плечей" << endl;
	cout << " Х поставте руки перед собою дл€ балансу" << endl;
	cout << " Х тримайте спину пр€мо ≥ опускайтесь, поки стегна не утвор€ть паралель з п≥длогою" << endl;
		cout << " Х кол≥на не мають виступати за пальц≥ н≥г" << endl;
	cout << " Х видихн≥ть ≥ поверн≥тьс€ у вих≥дне положенн€" << endl << endl;
	cout << " Х повтор≥ть вправу 20 раз" << endl;
}