#include "Shrug.h"
void Shrug::DoExercise() { // робимо вправу
	SetName("пожиманн€ плечима"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void Shrug::ShowInfo() { // виводимо про вправу
	cout << " ¬права дл€ розвитку верхньоњ частини трапец≥Їпод≥бного м'€за---" << endl
		 << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х в≥зьм≥ть в обидв≥ руки (роз≥гнут≥, але не док≥нц€) гантел≥" << endl;
	cout << " Х п≥дн≥майте-опускайте плеч≥ з цими гантел€ми в руках" << endl;
	cout << " Х плеч≥ повинн≥ бути в≥дведен≥ назад, а лопатки зведен≥" << endl <<
		endl;
	cout << " Х ---повтор≥ть вправу 20 раз---" << endl;
}