#include "SkakalkaJump.h"
void SkakalkaJump::DoExercise() { // робимо вправу
	SetName("стрибки з≥ скакалкою"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void SkakalkaJump::ShowInfo() { // виводимо про вправу
	cout << " ¬они розвивають м'€зи н≥г, робл€ть њх стрункими ≥ красивими, служать проф≥лактикою" << endl <<
		" плоскостопост≥; розвивають серцево-судинну ≥ дихальну системи; зм≥цнюють м'€зи тазового дна" << endl 
		<< endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х ноги злегка з≥гнут≥ в кол≥нах, ступн≥ разом, тулуб ≥ голова розташован≥ пр€мо" << endl;
	cout << " Х руки розгорнут≥, передпл≥чч€ в сторони, л≥кт≥ близько до тулуба" <<
		endl;
	cout << " Х обертанн€ скакалки зд≥йснюйте кист€ми, а не руками" << endl;
	cout << " Х ѕри виконанн≥ стрибк≥в тулуб тримайте пр€мим, див≥тьс€ треба пр€мо перед собою. " << endl << endl;
	cout << " Х повтор≥ть вправу 20 раз" << endl;
}