#include "StanovaPull.h"
void StanovaPull::DoExercise()
{ // робимо вправу
	SetName("станова т€га");
}
void StanovaPull::ShowInfo()
{ // виводимо про вправу
	cout << "---вправа дл€ зм≥цненн€ м'€з≥в попереку, що дозвол€Ї в прис≥данн€х краще прокачувати ноги---" << endl << endl;

	cout << "¬иконанн€: " << endl;
	cout << "Х  поставте перед собою гантелю або штангу" << endl;
	cout << "Х  ≥ п≥дн≥майте штангу р≥вном≥рно ≥ вертикально, не опускаючи вниз" << endl;
	cout << "Х  плеч≥ повинн≥ бути в≥дведен≥ назад, а лопатки зведен≥" << endl << endl;

	cout << "Х  ---повтор≥ть вправу 10 раз---" << endl;
}