#include "StepUps.h"
void StepUps::DoExercise() { // робимо вправу
	SetName("степ-апс"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void StepUps::ShowInfo() { // виводимо про вправу
	cout << " ¬права працюЇ з вашими мТ€зами стегон та с≥дниць, покращуЇ вашу р≥вновагу" << endl << endl;
	cout << " ¬иконанн€: " << endl;
	cout << " Х станьте на лавочку правою ногою, п≥дн≥м≥ть л≥ве кол≥но вгору, утримуючи гантел≥ по боках" << endl;
	cout << " Х опуст≥ть л≥ву ногу, з≥йд≥ть з лавки чи ≥ншого пристосуванн€" << endl
		<< endl;
	cout << " Х повтор≥ть 2 п≥дходи (15 на праву ногу, 15 на л≥ву)" << endl;
}
