#include "VidjimNaBrus.h"
void VidjimNaBrus::DoExercise() { // робимо вправу
	SetName("в≥джиманн€ на брусах"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void VidjimNaBrus::ShowInfo() { // виводимо про вправу
	cout << " ¬ит€гнутими руками в≥зьм≥тьс€ за бруси. “≥ло йде вниз, руки згинаютьс€ в "<< endl;
	cout << "л≥кт€х, при цьому, вони повинн≥ бути спр€мован≥ в сторони.–уки розгинаютьс€. " << endl
		<< endl;
	cout << " Х повтор≥ть вправу 10 раз" << endl;
}
