#include "Vidjimannya.h"
void Vidjimannya::DoExercise() { // робимо вправу
	SetName("в≥джиманн€"); // <- ¬писати назву вправи
	cout << " ¬и робите вправу " << name << endl;
	int key;
	cout << " [1] Ч як виконувати вправу" << endl;
	cout << " [2] Ч «авершити виконанн€ вправи" << endl;
	cout << " [0] Ч ¬ийти з програми" << endl;
	do {
		cout << " ¬вед≥ть ваше значенн€:"; cin >> key;
	} while (key != 1 && key != 2 && key != 0);
	cout << endl << endl;
	switch (key) {
	case 1:
		ShowInfo(); // показуЇмо ≥нф. про вправу ≥ повертаЇмось до цього меню
		DoExercise();
	case 2:
		break; // припин€Їмо виконанн€ ц≥Їњ вправи
	case 0:
		exit(0); // виходимо з програми
	}
}
void Vidjimannya::ShowInfo() { // виводимо про вправу
	cout << " ¬≥джиманн€ - найпрост≥ше ≥ доступне вправу, €ке в той же час дуже" << endl;
	cout << "ефективно.¬иконувати його потр≥бно в такий спос≥б : ѕотр≥бно л€гти, долон≥ пом≥стити на" << endl;
	cout << "р≥вн≥ плечей, т≥ло ≥ голова повинн≥ розташовуватис€ паралельно п≥длоз≥; " << endl;
	cout << "«гинайте л≥кт≥ ≥ опускайтес€ до п≥длоги " << endl << endl;
	cout << " Х повтор≥ть вправу 20 раз" << endl;
}